
{
  "header.about_me": "About Me",
  "header.projects": "Projects",
  "header.experience": "Experience",
  "header.skills": "Skills",
  "header.contact": "Contact",
  "header.change_language": "Change language",
  "header.change_to_light_mode": "Change to light mode",
  "header.change_to_dark_mode": "Change to dark mode",

  "hero.greeting": "Hi 👋, I'm",
  "hero.developer_role": "Computer Systems Engineer | Junior Programmer",
  "hero.location": "México 🇲🇽",
  "hero.description": "I'm a software developer focused on transforming ideas into digital solutions. I build functional and efficient applications for web and mobile.",
  "hero.contact_me": "Contact Me",
  "hero.download_cv": "Download CV",

  "about_me.title": "About Me",
  "about_me.p1": "Hi, I'm Rubén Suárez Díaz. I am a recent **Computer Systems Engineer** graduate from {{university}}. My passion is to **leverage technology to create innovative solutions that improve everyday life**.",
  "about_me.highlight1_p1": "Universidad de las Américas Puebla (UDLAP)",
  "about_me.p2": "During my education, I gained practical experience in **Angular, Python, TypeScript, and JavaScript**, in addition to taking relevant courses such as mobile application development, software engineering, artificial intelligence, UX, HCI, machine learning, computer vision, and advanced databases.",
  "about_me.p3": "My goal is to become a **leading application developer**, combining creativity and technical knowledge to design transformative digital experiences. My fondness for video games fuels my curiosity for programming, which is why I keep up with the latest technological trends, explore new tools, and lead parallel projects that integrate my interests in applications and entertainment. Beyond the digital realm, I am a football enthusiast: I enjoy both playing and following matches, a passion that fills me with energy and motivates me to give my best in every challenge.",


  "projects.title": "Projects",
  "projects.pacto.title": "Pacto: Smart Contract Management with Blockchain",
  "projects.pacto.description": "Developed a web platform in Angular for the creation, signing, and interaction with smart contracts, reducing the time required to complete a contract flow by 50% compared to traditional methods. Implemented Solidity contracts deployed on the Sepolia testnet, integrating MetaMask, ethers.js, and Firestore for secure, automated, and decentralized management.",
  "projects.mobile_academic.title": "Mobile Academic Management",
  "projects.mobile_academic.description": "Developed a mobile application for Android in Kotlin that allows managing subjects, attendance with QR scanning, and student grades, focused on academic environments. Automated academic control, reducing manual management time by 70% and improving student data traceability.",
  "projects.iot_monitoring.title": "Smart Temperature Monitoring with IoT",
  "projects.iot_monitoring.description": "Implemented an IoT system with ESP32 and MLX90614 sensor for real-time chocolate temperature monitoring, sending automated WhatsApp alerts via Twilio when critical thresholds were exceeded, which reduced manual supervision by 80%. Integrated InfluxDB and Grafana, also reduced non-productive time by 35%, preventing shutdowns due to overheating and allowing production to continue without stopping machines, which increased system operational availability.",
  "projects.cine_series_hub.title": "Cine & Series Hub",
  "projects.cine_series_hub.description": "Developed a Kotlin application integrating the TMDb API to explore movies and series with a favorites system, intuitive navigation, and responsive design. Optimized performance with efficient RecyclerView handling and network consumption, reducing loading time by 35% and increasing user retention to 90% in pilot tests.",
  "projects.inclusive_reservation.title": "Inclusive Real-time Booking Web Platform",
  "projects.inclusive_reservation.description": "Developed an Angular web application with a real-time booking system, barber profiles with portfolios, anonymous ratings, and automatic SMS and email reminders. Reduced booking time by 55%, increased success rate to 96%, and improved overall usability (SUS: 84), integrating full accessibility for users with visual or motor limitations.",
  "projects.sms_encryption.title": "SMS Encryption using RSA and SSL/TLS Analysis",
  "projects.sms_encryption.description": "Developed a messaging application for Android using Kotlin and Android Studio, integrating RSA encryption for secure SMS communications with user authentication and message storage backed by Firebase. Optimized decryption performance by implementing RSA-CRT, reducing decryption time from 4,053 ms to 1,172 ms (3 times faster), ensuring real-time security.",
  "projects.ml_travel_prediction.title": "Travel Cancellation Prediction using Machine Learning",
  "projects.ml_travel_prediction.description": "Implemented an end-to-end ML workflow on 126 travel records to predict cancellations. Preprocessed data by extracting temporal features, scaling numerical variables, and clustering cancellation rates.",
  "projects.parking_system.title": "Parking Management System",
  "projects.parking_system.description": "Developed a multi-platform mobile application to optimize university parking, showing real-time space availability and allowing reservations. Integrated geolocation and map services, reducing parking search time by 40% and increasing space occupancy by 30%.",
  "projects.cancer_support_app.title": "Support Application for Oncology Patients",
  "projects.cancer_support_app.description": "Led the creation of a multi-platform mobile application with Dart, offering personalized emotional support to oncology patients through an AI-powered chatbot. Chosen to be part of the medical students' thesis.",
  "projects.sql_transaction_system.title": "SQL Transaction Management System",
  "projects.sql_transaction_system.description": "Developed a transaction management application with a graphical interface using JavaScript and SQL. Optimized database operations to support over 500 transactions per hour, reducing processing times by 25% and ensuring high data integrity.",
  "projects.super_mario_bros.title": "Super Mario Bros",
  "projects.super_mario_bros.description": "Developed a retro platformer game in C#, with dynamic level design and responsive controls, evoking the classic Mario Bros experience.",
  "projects.vending_machine_logic.title": "Vending Machine Logic (VHDL)",
  "projects.vending_machine_logic.description": "Designed the control logic of a vending machine on the Basys 3 FPGA board using VHDL and developed digital circuits to process coins and dispense products, achieving a high success rate in simulations.",


  "experience.title": "Experience",
  "experience.work_tab": "Work",
  "experience.education_tab": "Education",
  "experience.halliburton.company": "Halliburton - Landmark Software & Services",
  "experience.halliburton.location": "Villahermosa, Mexico",
  "experience.halliburton.role": "Web Developer Intern (Professional Internship)",
  "experience.halliburton.period": "July 2024 - December 2024",
  "experience.halliburton.desc1": "Angular Experience and Certification: Completed an intensive Angular course on Udemy and obtained the corresponding certification, establishing a solid technical foundation that boosted the development of innovative web applications.",
  "experience.halliburton.desc2": "Creation of Cost Efficiency Dashboards: Developed dynamic dashboards to monitor and analyze non-productive time (NPT), supporting data-driven strategies to reduce operational costs.",
  "experience.halliburton.desc3": "Agile Methodologies: Employed agile practices to deliver scalable, high-quality solutions aligned with Landmark Software & Services' strategic objectives.",
  "experience.enactus_hackathon.company": "ENACTUS Changemakers Hackathon 2025",
  "experience.enactus_hackathon.period": "May 2025",
  "experience.enactus_hackathon.desc1": "Developed the \"STEMify\" app in Swift for iOS: an inclusive solution guiding undecided youth towards STEM careers through guided curiosity, gamification, and role model inspiration; recognized with second place in the best solution challenge proposed by Bosch.",
  "experience.enactus_hackathon.desc2": "Scalable Educational Architecture: Implemented geolocation with CoreLocation and MapKit, web scraping of universities, Firestore integration, and custom flows; highlighted for its social impact, accessibility, and UX approach focused on vocational exploration.",
  "experience.enactus_challenge.company": "ENACTUS Changemakers Social Challenge 2024",
  "experience.enactus_challenge.period": "November 2024",
  "experience.enactus_challenge.desc1": "Development of the \"Cultivo Sano\" (Healthy Crop) app in Swift for iOS: Led the development of an application that empowers rural communities through computer vision for early detection of plant diseases; project aligned with the SDGs and awarded on the challenge podium.",
  "experience.enactus_challenge.desc2": "Diagnostic Efficacy: Trained a robust detection model with over 10,000 plant images, achieving 87% accuracy and reducing diagnosis time by 60% compared to traditional methods.",

  "education.udlap.institution": "Universidad de las Américas Puebla (UDLAP)",
  "education.udlap.degree": "Bachelor of Computer Systems Engineering",
  "education.udlap.period": "Graduation June 2025",
  "education.udlap.average": "GPA: 9.4",
  "education.udlap.relevant_courses": "Relevant courses: Mobile application development, Software engineering, Artificial intelligence, UX, HCI, Machine learning, Computer vision, Advanced databases.",


  "skills.title": "Technologies",
  "skills.description": "I am proficient in a variety of modern technologies that allow me to build functional and robust solutions. These are some of my main technologies.",
  "skills.languages": "Programming Languages",
  "skills.tools": "Tools",
  "skills.other_languages": "Languages",
  "skills.lang.swift": "Swift",
  "skills.lang.kotlin": "Kotlin",
  "skills.lang.dart": "Dart",
  "skills.lang.java": "Java",
  "skills.lang.python": "Python",
  "skills.lang.angular": "Angular",
  "skills.lang.javascript": "JavaScript",
  "skills.lang.cpp": "C++",
  "skills.lang.sql": "SQL",
  "skills.lang.arduino": "Arduino",
  "skills.lang.vhdl": "VHDL",
  "skills.lang.html": "HTML",
  "skills.lang.css": "CSS",
  "skills.lang.lua": "Lua",
  "skills.lang.latex": "Latex",
  "skills.tool.vscode": "Visual Studio Code",
  "skills.tool.xcode": "XCode",
  "skills.tool.visual_studio_community": "Visual Studio Community",
  "skills.tool.git_github": "Git/GitHub",
  "skills.tool.arduino_ide": "Arduino IDE",
  "skills.tool.excel": "Excel",
  "skills.other.spanish": "Spanish (native)",
  "skills.other.english": "English (fluent)",
  "skills.other.german": "German (basic)",


  "contact.cta": "Interested in working together?",
  "contact.send_message": "Send me a message",
  "contact.copy_email": "Copy email",
  "contact.copied": "Copied!"
}