
{
  "header.about_me": "About Me",
  "header.projects": "Projects",
  "header.experience": "Experience",
  "header.skills": "Skills",
  "header.contact": "Contact",
  "header.change_language": "Change language",
  "header.change_to_light_mode": "Change to light mode",
  "header.change_to_dark_mode": "Change to dark mode",

  "hero.greeting": "Hi 👋, I'm",
  "hero.developer_role": "Computer Systems Engineer | Junior Programmer",
  "hero.location": "México 🇲🇽",
  "hero.description": "I'm a software developer focused on transforming ideas into digital solutions. I build functional and efficient applications for web and mobile.",
  "hero.contact_me": "Contact Me",
  "hero.download_cv": "Download CV",

  "about_me.title": "About Me",
  "about_me.p1": "Hi, I'm Rubén Suárez Díaz. I am a recent **Computer Systems Engineer** graduate from {{university}}. My passion is to **leverage technology to create innovative solutions that improve everyday life**.",
  "about_me.highlight1_p1": "Universidad de las Américas Puebla (UDLAP)",
  "about_me.p2": "During my education, I gained practical experience in **Angular, Python, TypeScript, and JavaScript**, in addition to taking relevant courses such as mobile application development, software engineering, artificial intelligence, UX, HCI, machine learning, computer vision, and advanced databases.",
  "about_me.p3": "My goal is to become a **leading application developer**, combining creativity and technical knowledge to design transformative digital experiences. My fondness for video games fuels my curiosity for programming, which is why I keep up with the latest technological trends, explore new tools, and lead parallel projects that integrate my interests in applications and entertainment. Beyond the digital realm, I am a football enthusiast: I enjoy both playing and following matches, a passion that fills me with energy and motivates me to give my best in every challenge.",


  "projects.title": "Projects",
"projects.pacto.title": "Pacto: Smart Contract Management with Blockchain",
  "projects.pacto.description_1": "Pacto is a web platform that simplifies the creation, signing, and management of smart contracts. It uses blockchain technology to automate contractual flows, offering security and decentralization.",
  "projects.pacto.description_2": "It drastically reduces the time required to complete a contract flow compared to traditional methods, ensuring secure and automated management.",

  "projects.mobile_academic.title": "Mobile Academic Management",
  "projects.mobile_academic.description_1": "Mobile Academic Management is an Android mobile application designed to optimize academic management. It allows students and teachers to control subjects, record attendance with QR scanning, and view grades.",
  "projects.mobile_academic.description_2": "This tool efficiently automates academic control, improving student data traceability and reducing manual management time.",

  "projects.cultivo_sano.title": "Cultivo Sano: Plant Disease Detection",
  "projects.cultivo_sano.description_1": "Cultivo Sano is an iOS mobile application that uses computer vision for early and accurate detection of plant diseases. It empowers rural communities by offering fast and reliable diagnoses, improving crop health.",
  "projects.cultivo_sano.description_2": "It integrates a robust detection model trained with over 10,000 images, achieving 87% accuracy and reducing diagnosis time by 60% compared to traditional methods, with efficient on-device processing.",

  "projects.iot_monitoring.title": "Smart Temperature Monitoring with IoT",
  "projects.iot_monitoring.description_1": "This IoT system monitors temperature in real-time and sends automated WhatsApp alerts when critical thresholds are exceeded. It allows supervising industrial processes (e.g., chocolate) and optimizing production.",
  "projects.iot_monitoring.description_2": "By preventing overheating and reducing non-productive time, this system increases operational availability and efficiency in manufacturing environments.",

  "projects.cine_series_hub.title": "Cine & Series Hub",
  "projects.cine_series_hub.description_1": "Cine & Series Hub is a mobile application that integrates the TMDb API to explore movies and series. It offers a favorites system, intuitive navigation, and a responsive design for a fluid user experience.",
  "projects.cine_series_hub.description_2": "It optimizes performance with efficient network consumption handling, reducing loading time and increasing user retention in pilot tests.",

  "projects.inclusive_reservation.title": "Inclusive Real-time Booking Web Platform",
  "projects.inclusive_reservation.description_1": "This web platform offers a real-time booking system with service profiles, portfolios, anonymous ratings, and automatic SMS and email reminders.",
  "projects.inclusive_reservation.description_2": "Its inclusive design ensures full accessibility for users with visual or motor limitations, improving usability and booking success rate.",

  "projects.sms_encryption.title": "SMS Encryption using RSA and SSL/TLS Analysis",
  "projects.sms_encryption.description_1": "This Android messaging application offers secure SMS communications using RSA encryption. It ensures message privacy and authentication, with storage backed by Firebase.",
  "projects.sms_encryption.description_2": "It optimizes decryption performance by implementing RSA-CRT, ensuring real-time security and tripling processing speed.",

  "projects.ml_travel_prediction.title": "Travel Cancellation Prediction using Machine Learning",
  "projects.ml_travel_prediction.description_1": "This Machine Learning system predicts travel cancellations. It analyzes historical data and extracts temporal features to offer accurate predictions on cancellation probability.",
  "projects.ml_travel_prediction.description_2": "It helps optimize reservation management by identifying patterns and risks, enabling more informed decision-making.",

  "projects.parking_system.title": "Parking Management System",
  "projects.parking_system.description_1": "This parking management system optimizes parking space availability in real-time. It allows users to locate and reserve spaces, integrating geolocation and map services for easy navigation.",
  "projects.parking_system.description_2": "It significantly reduces parking search time and increases space occupancy, improving overall campus efficiency.",

  "projects.cancer_support_app.title": "Support Application for Oncology Patients",
  "projects.cancer_support_app.description_1": "This multi-platform mobile application offers personalized emotional support to oncology patients. It integrates an AI-powered chatbot to provide companionship and resources, serving as an innovative support tool.",
  "projects.cancer_support_app.description_2": "It was selected to be part of medical students' thesis, highlighting its impact and relevance in the healthcare field.",

  "projects.sql_transaction_system.title": "SQL Transaction Management System",
  "projects.sql_transaction_system.description_1": "This transaction management system with a graphical interface optimizes database operations. It supports a high volume of transactions per hour, ensuring data integrity and efficient processing.",
  "projects.sql_transaction_system.description_2": "It reduces processing times and guarantees high data integrity, making it a robust solution for high-transaction environments.",

  "projects.super_mario_bros.title": "Super Mario Bros (Recreation)",
  "projects.super_mario_bros.description_1": "Super Mario Bros is a retro platformer game that recreates the classic experience of the original. It offers dynamic level design and responsive controls for authentic and fun gameplay.",
  "projects.super_mario_bros.description_2": "It evokes the nostalgia of the classic Mario Bros experience with a modern implementation in C#.",

  "projects.vending_machine_logic.title": "Vending Machine Logic (VHDL)",
  "projects.vending_machine_logic.description_1": "This project implements the control logic for a vending machine. It uses VHDL and digital circuits to process coin payments and dispense products.",
  "projects.vending_machine_logic.description_2": "It ensures a high success rate in simulations, demonstrating the reliability of the design for automated machine operation.",

  "projects.stemify.title": "STEMify: STEM Career Guidance",
  "projects.stemify.description": "iOS mobile app guiding youth towards STEM careers through guided curiosity, gamification, and role model inspiration. Features university geolocation, web scraping, and custom flows.",


  "experience.title": "Experience",
  "experience.work_tab": "Work",
  "experience.education_tab": "Education",
  "experience.halliburton.company": "Halliburton - Landmark Software & Services",
  "experience.halliburton.location": "Villahermosa, Mexico",
  "experience.halliburton.role": "Web Developer Intern (Professional Internship)",
  "experience.halliburton.period": "July 2024 - December 2024",
  "experience.halliburton.desc1": "Angular Experience and Certification: Completed an intensive Angular course on Udemy and obtained the corresponding certification, establishing a solid technical foundation that boosted the development of innovative web applications.",
  "experience.halliburton.desc2": "Creation of Cost Efficiency Dashboards: Developed dynamic dashboards to monitor and analyze non-productive time (NPT), supporting data-driven strategies to reduce operational costs.",
  "experience.halliburton.desc3": "Agile Methodologies: Employed agile practices to deliver scalable, high-quality solutions aligned with Landmark Software & Services' strategic objectives.",
  "experience.enactus_hackathon.company": "ENACTUS Changemakers Hackathon 2025",
  "experience.enactus_hackathon.period": "May 2025",
  "experience.enactus_hackathon.desc1": "Developed the \"STEMify\" app in Swift for iOS: an inclusive solution guiding undecided youth towards STEM careers through guided curiosity, gamification, and role model inspiration; recognized with second place in the best solution challenge proposed by Bosch.",
  "experience.enactus_hackathon.desc2": "Scalable Educational Architecture: Implemented geolocation with CoreLocation and MapKit, web scraping of universities, Firestore integration, and custom flows; highlighted for its social impact, accessibility, and UX approach focused on vocational exploration.",
  "experience.enactus_challenge.company": "ENACTUS Changemakers Social Challenge 2024",
  "experience.enactus_challenge.period": "November 2024",
  "experience.enactus_challenge.desc1": "Development of the \"Cultivo Sano\" (Healthy Crop) app in Swift for iOS: Led the development of an application that empowers rural communities through computer vision for early detection of plant diseases; project aligned with the SDGs and awarded on the challenge podium.",
  "experience.enactus_challenge.desc2": "Diagnostic Efficacy: Trained a robust detection model with over 10,000 plant images, achieving 87% accuracy and reducing diagnosis time by 60% compared to traditional methods.",

  "education.udlap.institution": "Universidad de las Américas Puebla (UDLAP)",
  "education.udlap.degree": "Bachelor of Computer Systems Engineering",
  "education.udlap.period": "Graduation June 2025",
  "education.udlap.average": "GPA: 9.4",
  "education.udlap.relevant_courses": "Relevant courses: Mobile application development, Software engineering, Artificial intelligence, UX, HCI, Machine learning, Computer vision, Advanced databases.",


  "skills.title": "Technologies",
  "skills.description": "I am proficient in a variety of modern technologies that allow me to build functional and robust solutions. These are some of my main technologies.",
  "skills.languages": "Programming Languages",
  "skills.tools": "Tools",
  "skills.other_languages": "Languages",
  "skills.lang.swift": "Swift",
  "skills.lang.kotlin": "Kotlin",
  "skills.lang.dart": "Dart",
  "skills.lang.java": "Java",
  "skills.lang.python": "Python",
  "skills.lang.angular": "Angular",
  "skills.lang.javascript": "JavaScript",
  "skills.lang.cpp": "C++",
  "skills.lang.sql": "SQL",
  "skills.lang.arduino": "Arduino",
  "skills.lang.vhdl": "VHDL",
  "skills.lang.html": "HTML",
  "skills.lang.css": "CSS",
  "skills.lang.lua": "Lua",
  "skills.lang.latex": "Latex",
  "skills.tool.vscode": "Visual Studio Code",
  "skills.tool.xcode": "XCode",
  "skills.tool.visual_studio_community": "Visual Studio Community",
  "skills.tool.git_github": "Git/GitHub",
  "skills.tool.arduino_ide": "Arduino IDE",
  "skills.tool.excel": "Excel",
  "skills.other.spanish": "Spanish (native)",
  "skills.other.english": "English (fluent)",
  "skills.other.german": "German (basic)",


  "contact.cta": "Interested in working together?",
  "contact.send_message": "Send me a message",
  "contact.copy_email": "Copy email",
  "contact.copied": "Copied!"
}