
{
  "header.about_me": "Sobre m铆",
  "header.projects": "Proyectos",
  "header.experience": "Experiencia",
  "header.skills": "Habilidades",
  "header.contact": "Contacto",
  "header.change_language": "Cambiar idioma",
  "header.change_to_light_mode": "Cambiar a modo claro",
  "header.change_to_dark_mode": "Cambiar a modo oscuro",

  "hero.greeting": "Hola , soy",
  "hero.developer_role": "Computer Systems Engineer",
  "hero.location": "M茅xico 拆",
  "hero.description": "Soy un desarrollador de software enfocado en transformar ideas en soluciones digitales. Construyo aplicaciones funcionales y eficientes para web y m贸vil.",
  "hero.contact_me": "Cont谩ctame",
  "hero.download_cv": "Descargar CV",

  "about_me.title": "Sobre m铆",
  "about_me.p1": "Hola, soy Rub茅n Su谩rez D铆az. Soy un **Ingeniero en Sistemas Computacionales** reci茅n egresado de la {{university}}. Mi pasi贸n es **aprovechar la tecnolog铆a para crear soluciones innovadoras que mejoren la vida cotidiana**.",
  "about_me.highlight1_p1": "Universidad de las Am茅ricas Puebla (UDLAP)",
  "about_me.p2": "Durante mi formaci贸n, he adquirido experiencia pr谩ctica en **Angular, Python, TypeScript y JavaScript**, adem谩s de haber cursado materias relevantes como desarrollo de aplicaciones m贸viles, ingenier铆a de software, inteligencia artificial, UX, HCI, aprendizaje de m谩quina, visi贸n artificial y bases de datos avanzadas.",
  "about_me.p3": "Mi objetivo es convertirme en un **desarrollador de aplicaciones l铆der**, combinando creatividad y conocimientos t茅cnicos para dise帽ar experiencias digitales transformadoras. Mi afici贸n por los videojuegos alimenta mi curiosidad por la programaci贸n, por lo que me mantengo al d铆a con las 煤ltimas tendencias tecnol贸gicas, exploro nuevas herramientas y lidero proyectos paralelos que integran mis intereses en aplicaciones y entretenimiento. M谩s all谩 del 谩mbito digital, soy un entusiasta del f煤tbol: disfruto tanto practicarlo como seguir los partidos, una pasi贸n que me llena de energ铆a y me motiva a dar lo mejor en cada desaf铆o.",


  "projects.title": "Proyectos",
  "projects.pacto.title": "Pacto: Gesti贸n inteligente de contratos con blockchain",
  "projects.pacto.description": "Desarroll茅 una plataforma web en Angular para la creaci贸n, firma e interacci贸n con contratos inteligentes, reduciendo en un 50% el tiempo requerido para completar un flujo de contrato respecto a m茅todos tradicionales. Implement茅 contratos en Solidity desplegados en la testnet Sepolia, integrando MetaMask, ethers.js y Firestore para una gesti贸n segura, automatizada y descentralizada.",
  "projects.mobile_academic.title": "Mobile Academic Management",
  "projects.mobile_academic.description": "Desarroll茅 una aplicaci贸n m贸vil para Android en Kotlin que permite gestionar materias, asistencia con escaneo QR y calificaciones de estudiantes, enfocada en entornos acad茅micos. Automatiz贸 el control acad茅mico, reduciendo el tiempo de gesti贸n manual en un 70% y mejorando la trazabilidad de datos estudiantiles.",
  "projects.iot_monitoring.title": "Monitoreo inteligente de temperatura con IoT",
  "projects.iot_monitoring.description": "Implement茅 un sistema IoT con ESP32 y sensor MLX90614 para monitorear en tiempo real la temperatura de chocolate, enviando alertas automatizadas por WhatsApp a trav茅s de Twilio al superar umbrales cr铆ticos, lo que redujo la supervisi贸n manual en un 80%. Integr茅 InfluxDB y Grafana, adem谩s se redujo el TNP en un 35%, evitando paros por sobrecalentamiento y permitiendo continuar la producci贸n sin detener las m谩quinas, lo que aument贸 la disponibilidad operativa del sistema.",
  "projects.cine_series_hub.title": "Cine & Series Hub",
  "projects.cine_series_hub.description": "Desarroll茅 una aplicaci贸n en Kotlin que integra la API de TMDb para explorar pel铆culas y series con sistema de favoritos, navegaci贸n intuitiva y dise帽o responsivo. Optimic茅 el rendimiento con manejo eficiente de RecyclerView y consumo de red, reduciendo el tiempo de carga en un 35% y aumentando la retenci贸n de usuarios al 90% en pruebas piloto.",
  "projects.inclusive_reservation.title": "Plataforma web inclusiva de reservas en tiempo real",
  "projects.inclusive_reservation.description": "Desarroll茅 una aplicaci贸n web en Angular con sistema de reservas en tiempo real, perfiles de barberos con portafolios, calificaciones an贸nimas y recordatorios autom谩ticos por SMS y correo. Reduje el tiempo de reserva en un 55%, elev茅 la tasa de 茅xito al 96% y mejor茅 la usabilidad general (SUS: 84), integrando accesibilidad total para usuarios con limitaciones visuales o motrices.",
  "projects.sms_encryption.title": "Cifrado SMS mediante RSA y an谩lisis SSL/TLS",
  "projects.sms_encryption.description": "Desarroll茅 una aplicaci贸n de mensajer铆a para Android utilizando Kotlin y Android Studio, integrando cifrado RSA para comunicaciones SMS seguras con autenticaci贸n de usuario y almacenamiento de mensajes respaldados por Firebase. Optimic茅 el rendimiento de descifrado mediante la implementaci贸n de RSA-CRT, reduciendo el tiempo de descifrado de 4,053 ms a 1,172 ms (3 veces m谩s r谩pido), lo que garantiza la seguridad en tiempo real.",
  "projects.ml_travel_prediction.title": "Predicci贸n de cancelaciones de viaje mediante aprendizaje de m谩quina",
  "projects.ml_travel_prediction.description": "Implement茅 un flujo de trabajo de ML de inicio a fin sobre 126 registros de viajes para predecir cancelaciones. Preproces茅 los datos extrayendo caracter铆sticas temporales, escalando variables num茅ricas y agrupando las tasas de cancelaci贸n.",
  "projects.parking_system.title": "Sistema de gesti贸n de estacionamientos",
  "projects.parking_system.description": "Desarroll茅 una aplicaci贸n m贸vil multiplataforma para optimizar el estacionamiento universitario, mostrando disponibilidad de espacios en tiempo real y permitiendo reservas. Integr茅 servicios de geolocalizaci贸n y mapas, reduciendo el tiempo de b煤squeda de estacionamiento en un 40% y aumentando la ocupaci贸n de plazas en un 30%.",
  "projects.cancer_support_app.title": "Aplicaci贸n de apoyo para pacientes oncol贸gicos",
  "projects.cancer_support_app.description": "Lider茅 la creaci贸n de una aplicaci贸n m贸vil multiplataforma con Dart, que ofrece apoyo emocional personalizado a pacientes oncol贸gicos mediante un chatbot potenciado por IA. Elegida para formar parte de la tesis de estudiantes de Medicina.",
  "projects.sql_transaction_system.title": "Sistema de gesti贸n de transacciones SQL",
  "projects.sql_transaction_system.description": "Desarroll茅 una aplicaci贸n de gesti贸n de transacciones con interfaz gr谩fica usando JavaScript y SQL. Optimic茅 las operaciones de base de datos para soportar m谩s de 500 transacciones por hora, reduciendo los tiempos de procesamiento en un 25% y garantizando alta integridad de datos.",
  "projects.super_mario_bros.title": "Super Mario Bros",
  "projects.super_mario_bros.description": "Desarroll茅 un juego de plataformas retro en C#, con dise帽o de niveles din谩mico y controles responsivos, evocando la experiencia cl谩sica de Mario Bros.",
  "projects.vending_machine_logic.title": "L贸gica de m谩quina expendedora (VHDL)",
  "projects.vending_machine_logic.description": "Dise帽茅 la l贸gica de control de una m谩quina expendedora en la placa FPGA Basys 3 usando VHDL y desarroll茅 circuitos digitales para procesar monedas y dispensar productos, logrando una alta tasa de 茅xito en simulaciones.",


  "experience.title": "Experiencia",
  "experience.work_tab": "Trabajo",
  "experience.education_tab": "Estudios",
  "experience.halliburton.company": "Halliburton - Landmark Software & Services",
  "experience.halliburton.location": "Villahermosa, M茅xico",
  "experience.halliburton.role": "Desarrollador web en pr谩cticas (Pr谩cticas profesionales)",
  "experience.halliburton.period": "Julio 2024 - Diciembre 2024",
  "experience.halliburton.desc1": "Experiencia y certificaci贸n en Angular: Complet茅 un curso intensivo de Angular en Udemy y obtuve la certificaci贸n correspondiente, estableciendo una s贸lida base t茅cnica que impuls贸 el desarrollo de aplicaciones web innovadoras.",
  "experience.halliburton.desc2": "Creaci贸n de tableros de control para la eficiencia de costes: Desarroll茅 tableros din谩micos para supervisar y analizar el tiempo no productivo (TNP), respaldando estrategias basadas en datos para reducir costes operativos.",
  "experience.halliburton.desc3": "Metodolog铆as 谩giles: Emple茅 pr谩cticas 谩giles para ofrecer soluciones escalables y de alta calidad alineadas con los objetivos estrat茅gicos de Landmark Software & Services.",
  "experience.enactus_hackathon.company": "ENACTUS Changemakers Hackathon 2025",
  "experience.enactus_hackathon.period": "Mayo 2025",
  "experience.enactus_hackathon.desc1": "Desarroll茅 la aplicaci贸n \"STEMify\" en Swift para iOS: una soluci贸n inclusiva que orienta a j贸venes indecisos hacia carreras STEM mediante curiosidad guiada, gamificaci贸n e inspiraci贸n en modelos a seguir; reconocida con el segundo lugar en el reto a la mejor soluci贸n propuesto por la empresa Bosch.",
  "experience.enactus_hackathon.desc2": "Arquitectura educativa escalable: Implement茅 geolocalizaci贸n con CoreLocation y MapKit, scraping web de universidades, integraci贸n con Firestore y flujos personalizados; destacada por su impacto social, accesibilidad y enfoque UX centrado en la exploraci贸n vocacional.",
  "experience.enactus_challenge.company": "ENACTUS Changemakers Social Challenge 2024",
  "experience.enactus_challenge.period": "Noviembre 2024",
  "experience.enactus_challenge.desc1": "Desarrollo de la aplicaci贸n \"Cultivo Sano\" en Swift para iOS: Lider茅 el desarrollo de una aplicaci贸n que empodera a las comunidades rurales mediante visi贸n artificial para la detecci贸n temprana de enfermedades de las plantas; proyecto alineado con los ODS y premiado en el podio del desaf铆o.",
  "experience.enactus_challenge.desc2": "Eficacia diagn贸stica: Entren茅 un modelo de detecci贸n robusto con m谩s de 10.000 im谩genes de plantas, alcanzando un 87% de precisi贸n y reduciendo el tiempo de diagn贸stico en un 60% frente a m茅todos tradicionales.",

  "education.udlap.institution": "Universidad de las Am茅ricas Puebla (UDLAP)",
  "education.udlap.degree": "Licenciatura en Ingenier铆a en Sistemas Computacionales",
  "education.udlap.period": "Graduaci贸n en junio de 2025",
  "education.udlap.average": "Promedio: 9.4",
  "education.udlap.relevant_courses": "Cursos relevantes: Desarrollo de aplicaciones m贸viles, Ingenier铆a de software, Inteligencia artificial, UX, HCI, Aprendizaje de m谩quina, Visi贸n artificial, Bases de datos avanzadas.",


  "skills.title": "Tecnolog铆as",
  "skills.description": "Soy proficiente en una variedad de tecnolog铆as modernas que me permiten construir soluciones funcionales y robustas. Estas son algunas de mis principales tecnolog铆as.",
  "skills.languages": "Lenguajes de programaci贸n",
  "skills.tools": "Herramientas",
  "skills.other_languages": "Idiomas",
  "skills.lang.swift": "Swift",
  "skills.lang.kotlin": "Kotlin",
  "skills.lang.dart": "Dart",
  "skills.lang.java": "Java",
  "skills.lang.python": "Python",
  "skills.lang.angular": "Angular",
  "skills.lang.javascript": "JavaScript",
  "skills.lang.cpp": "C++",
  "skills.lang.sql": "SQL",
  "skills.lang.arduino": "Arduino",
  "skills.lang.vhdl": "VHDL",
  "skills.lang.html": "HTML",
  "skills.lang.css": "CSS",
  "skills.lang.lua": "Lua",
  "skills.lang.latex": "Latex",
  "skills.tool.vscode": "Visual Studio Code",
  "skills.tool.xcode": "XCode",
  "skills.tool.visual_studio_community": "Visual Studio Community",
  "skills.tool.git_github": "Git/GitHub",
  "skills.tool.arduino_ide": "Arduino IDE",
  "skills.tool.excel": "Excel",
  "skills.other.spanish": "Espa帽ol (nativo)",
  "skills.other.english": "Ingl茅s (fluido)",
  "skills.other.german": "Alem谩n (b谩sico)",


  "contact.cta": "驴Interesado en trabajar juntos?",
  "contact.send_message": "Env铆ame un mensaje",
  "contact.copy_email": "Copiar email",
  "contact.copied": "隆Copiado!"
}